# homebrew/bundle と homebrew/cask-fonts は Homebrew 本体に統合済みのため tap 不要

# -------------------------------------------------------------------
# Core VCS & CLI
# -------------------------------------------------------------------
brew "git"
brew "gh"

# -------------------------------------------------------------------
# エディタ
# -------------------------------------------------------------------
brew "neovim"
brew "vim"

# -------------------------------------------------------------------
# ターミナル多重化
# -------------------------------------------------------------------
brew "tmux"

# -------------------------------------------------------------------
# 検索・フィルタリング
# -------------------------------------------------------------------
brew "ripgrep"
brew "jq"

# -------------------------------------------------------------------
# ネットワーク
# -------------------------------------------------------------------
brew "curl"

# -------------------------------------------------------------------
# メディア処理
# -------------------------------------------------------------------
brew "ffmpeg"
brew "imagemagick"
brew "poppler"
brew "tesseract"
brew "tesseract-lang"

# -------------------------------------------------------------------
# ランタイム管理
# -------------------------------------------------------------------
brew "pyenv"
# Node.js は nvm で管理するため brew "node" は不要
brew "nvm"
brew "rbenv"

# -------------------------------------------------------------------
# パッケージ管理・ビルドツール
# -------------------------------------------------------------------
brew "stow"
brew "yarn"
brew "lua"
brew "luajit"

# -------------------------------------------------------------------
# セキュリティ
# -------------------------------------------------------------------
brew "gnupg"

# -------------------------------------------------------------------
# ネットワーク / VPN
# -------------------------------------------------------------------
brew "tailscale"

# -------------------------------------------------------------------
# パーサ
# -------------------------------------------------------------------
brew "tree-sitter@0.25"

# -------------------------------------------------------------------
# AI CLI ツール
# -------------------------------------------------------------------
brew "gemini-cli"

# -------------------------------------------------------------------
# ブラウザ管理
# -------------------------------------------------------------------
brew "defaultbrowser"      # macOS デフォルトブラウザ変更用 CLI

# -------------------------------------------------------------------
# 追加推奨: ファイル操作・ナビゲーション
# -------------------------------------------------------------------
brew "fd"               # find の高速代替
brew "fzf"              # ファジーファインダー
brew "bat"              # cat の高機能代替（シンタックスハイライト）
brew "eza"              # ls の高機能代替
brew "zoxide"           # スマートな cd 代替

# -------------------------------------------------------------------
# 追加推奨: Git 補助ツール
# -------------------------------------------------------------------
brew "git-delta"        # git diff の視覚的差分表示
brew "lazygit"          # git の TUI フロントエンド

# -------------------------------------------------------------------
# 追加推奨: データ処理
# -------------------------------------------------------------------
brew "yq"               # jq の YAML/XML 対応版
brew "wget"             # curl の代替ダウンローダー

# -------------------------------------------------------------------
# GUI アプリ (Cask)
# -------------------------------------------------------------------
cask "google-chrome"
cask "ghostty"
cask "iterm2"
cask "raycast"
cask "cmux"
cask "codex"
cask "cursor"
cask "orbstack"            # 軽量 Docker 互換環境（Docker Desktop 代替）
cask "qlmarkdown"

# -------------------------------------------------------------------
# 追加推奨: フォント
# -------------------------------------------------------------------
cask "font-hackgen-nerd"               # HackGen Nerd Font
cask "font-udev-gothic-nf"             # UDev Gothic Nerd Font
